---
kind: other
id: Methods.T:Autodesk.Revit.DB.ElementStructuralTypeFilter
source: html/a1b90782-7a97-21d9-ac06-e2ee5981e4ce.htm
---
# ElementStructuralTypeFilter Methods

Applies the filter to a given element.